#!/bin/bash
# Скрипт для запуска контроллера криптокотла

# Установка переменной DISPLAY для GUI
# Предполагается, что основной дисплей :0. При необходимости измените.
export DISPLAY=:0
# Если требуется, можно также установить XAUTHORITY, хотя это часто не нужно при запуске от имени вошедшего пользователя.
# export XAUTHORITY=/home/user/.Xauthority

# Переход в директорию проекта
cd /home/user/CONTROLLER

# Запуск основного скрипта приложения с аргументом для полноэкранного режима
# Убедитесь, что python3 указывает на нужную версию Python.
/usr/bin/python3 start_all_modules.py --auto-fullscreen 